In [1]:
import pandas as pd

In [2]:
#Serious data structure
city1=pd.Series([12,-6,8,-3])
city1

0    12
1    -6
2     8
3    -3
dtype: int64

In [3]:
#To print all the values in a series
city1.values

array([12, -6,  8, -3], dtype=int64)

In [4]:
#index of function
city1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
#datatype of function
city1.dtype

dtype('int64')

In [6]:
#changing the index
city2=pd.Series([12,-6,8,-3],index=['day 1','day 2','day 3','day 4'])
city2

day 1    12
day 2    -6
day 3     8
day 4    -3
dtype: int64

In [7]:
city2['day 3']

8

In [8]:
city2[['day 1','day 2','day 3']]

day 1    12
day 2    -6
day 3     8
dtype: int64

In [9]:
#checking the values with a condition
city2>0

day 1     True
day 2    False
day 3     True
day 4    False
dtype: bool

In [10]:
city2[city2>0]

day 1    12
day 3     8
dtype: int64

In [12]:
city2.min()

-6

In [13]:
city2.max()

12

In [14]:
city2[(city2>2)&(city2<9)]

day 3    8
dtype: int64

In [15]:
city2+3

day 1    15
day 2    -3
day 3    11
day 4     0
dtype: int64

In [16]:
city2-3

day 1    9
day 2   -9
day 3    5
day 4   -6
dtype: int64

In [18]:
city2*3

day 1    36
day 2   -18
day 3    24
day 4    -9
dtype: int64

In [19]:
city2/3

day 1    4.000000
day 2   -2.000000
day 3    2.666667
day 4   -1.000000
dtype: float64

In [23]:
#create a series object using dictionary
data={'keralam':28,'andhara':25,'tamilnadu':31,'karnataka':19,'delhi':38}
data=pd.Series(data)
data

keralam      28
andhara      25
tamilnadu    31
karnataka    19
delhi        38
dtype: int64

In [24]:
states=['andhara','delhi','tamilnadu','mp','keralam','karnataka']
city3 =pd.Series(data,index=states)
city3

andhara      25.0
delhi        38.0
tamilnadu    31.0
mp            NaN
keralam      28.0
karnataka    19.0
dtype: float64

In [25]:
#function to get no value
city3.isna()

andhara      False
delhi        False
tamilnadu    False
mp            True
keralam      False
karnataka    False
dtype: bool

In [26]:
city3[city3.isna()]

mp   NaN
dtype: float64

In [27]:
city3.notna()

andhara       True
delhi         True
tamilnadu     True
mp           False
keralam       True
karnataka     True
dtype: bool

In [28]:
city3[city3.notna()]

andhara      25.0
delhi        38.0
tamilnadu    31.0
keralam      28.0
karnataka    19.0
dtype: float64

In [29]:
#Data frame data structure
data= {'year':[2001,2002,2004,2005,2006],'states':['keralam','tamilnadu','andhra','karnataka','bihar'],'pop':[300,250,280,400,360]}
data

{'year': [2001, 2002, 2004, 2005, 2006],
 'states': ['keralam', 'tamilnadu', 'andhra', 'karnataka', 'bihar'],
 'pop': [300, 250, 280, 400, 360]}

In [30]:
pop_data=pd.DataFrame(data)
pop_data

   year     states  pop
0  2001    keralam  300
1  2002  tamilnadu  250
2  2004     andhra  280
3  2005  karnataka  400
4  2006      bihar  360

In [40]:
#adding column to a dataframe
pop_data1=pd.DataFrame(data,columns=['year','states','pop','income'])
pop_data1

   year     states  pop income
0  2001    keralam  300    NaN
1  2002  tamilnadu  250    NaN
2  2004     andhra  280    NaN
3  2005  karnataka  400    NaN
4  2006      bihar  360    NaN

In [42]:
pop_data1['pop']

0    300
1    250
2    280
3    400
4    360
Name: pop, dtype: int64

In [41]:
pop_data1['income']=[20000,30000,25000,12000,15000]
pop_data1

   year     states  pop  income
0  2001    keralam  300   20000
1  2002  tamilnadu  250   30000
2  2004     andhra  280   25000
3  2005  karnataka  400   12000
4  2006      bihar  360   15000

In [43]:
pop_data1['debt']=[320,450,200,150,140]
pop_data1

   year     states  pop  income  debt
0  2001    keralam  300   20000   320
1  2002  tamilnadu  250   30000   450
2  2004     andhra  280   25000   200
3  2005  karnataka  400   12000   150
4  2006      bihar  360   15000   140

In [44]:
pop_data1['savings']=pop_data1['income']-pop_data1['debt']
pop_data1

   year     states  pop  income  debt  savings
0  2001    keralam  300   20000   320    19680
1  2002  tamilnadu  250   30000   450    29550
2  2004     andhra  280   25000   200    24800
3  2005  karnataka  400   12000   150    11850
4  2006      bihar  360   15000   140    14860

In [49]:
pop_data1['depth']=600
pop_data1

   year     states  income  debt  savings  depth
0  2001    keralam   20000   320    19680    600
1  2002  tamilnadu   30000   450    29550    600
2  2004     andhra   25000   200    24800    600
3  2005  karnataka   12000   150    11850    600
4  2006      bihar   15000   140    14860    600

In [46]:
#delete a column
del pop_data1['pop']
pop_data1

   year     states  income  debt  savings  depth
0  2001    keralam   20000   320    19680    600
1  2002  tamilnadu   30000   450    29550    600
2  2004     andhra   25000   200    24800    600
3  2005  karnataka   12000   150    11850    600
4  2006      bihar   15000   140    14860    600

In [47]:
pop_data1.drop('depth')

KeyError: "['depth'] not found in axis"

In [50]:
#this method only print the change..does not save the change
pop_data1.drop('depth',axis=1)

   year     states  income  debt  savings
0  2001    keralam   20000   320    19680
1  2002  tamilnadu   30000   450    29550
2  2004     andhra   25000   200    24800
3  2005  karnataka   12000   150    11850
4  2006      bihar   15000   140    14860

In [51]:
pop_data1

   year     states  income  debt  savings  depth
0  2001    keralam   20000   320    19680    600
1  2002  tamilnadu   30000   450    29550    600
2  2004     andhra   25000   200    24800    600
3  2005  karnataka   12000   150    11850    600
4  2006      bihar   15000   140    14860    600

In [52]:
pop_data1=pop_data1.drop('depth',axis=1)
pop_data1

   year     states  income  debt  savings
0  2001    keralam   20000   320    19680
1  2002  tamilnadu   30000   450    29550
2  2004     andhra   25000   200    24800
3  2005  karnataka   12000   150    11850
4  2006      bihar   15000   140    14860

In [53]:
#dimension of data
pop_data1.ndim

2

In [54]:
#size of data will give total number of data present in the dataframe
pop_data1.size

25

In [4]:
#import a file
auto_data=pd.read_csv('auto-mpg.csv')

In [5]:
auto_data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10